/* 省 市 县 三级分类的数据 */
//一级分类
var provinceAreaArr = ["北京市", "上海市", "天津市", "重庆市", "河北省", "山西省", "河南省", "辽宁省", "吉林省", "黑龙江省", "内蒙古", "江苏省", "山东省", "安徽省", "浙江省", "福建省", "湖北省", "湖南省", "广东省", "广西省", "江西省", "四川省", "海南省", "贵州省", "云南省", "西藏", "陕西省", "甘肃省", "青海", "宁夏省", "新疆", "台湾", "香港", "澳门", "钓鱼岛"];
//二级分类
var cityAreaArr = [
	// 北京
	["朝阳区", "海淀区", "西城区", "东城区", "崇文区", "宣武区", "丰台区", "石景山区", "门头沟", "房山区", "通州区", "大兴区", "顺义区", "怀柔区", "密云区", "昌平区", "平谷区", "延庆县"],
	// 上海
	["徐汇区", "长宁区", "静安区", "闸北区", "虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "浦东新区", "青浦区", "松江区", "金山区", "南汇区", "奉贤区", "普陀区", "崇明县", "黄浦区"],
	// 天津
	["东丽区", "和平区", "河北区", "河东区", "河西区", "红桥区", "蓟县", "静海县", "南开区", "塘沽区", "西青区", "武清区", "津南区", "汉沽区", "大港区", "北辰区", "宝坻区", "宁河县"],
	// 重庆
	["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "黔江区", "长寿区", "江津区", "合川区", "南川区", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "永川区", "北部新区"],
	// 河北
	["石家庄市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "秦皇岛市", "唐山市", "沧州市", "廊坊市", "衡水市"],
	// 山西
	["太原市", "大同市", "阳泉市", "晋城市", "朔州市", "晋中市", "忻州市", "吕梁市", "临汾市", "运城市", "长治市"],
	// 河南
	["郑州市", "开封市", "洛阳市", "平顶山市", "焦作市", "鹤壁市", "新乡市", "安阳市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "周口市", "驻马店市", "信阳市", "济源市"],
	// 辽宁
	["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "葫芦岛市", "营口市", "盘锦市", "阜新市", "辽阳市", "朝阳市", "铁岭市"],
	// 吉林
	["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边州"],
	// 黑龙江
	["鹤岗市", "双鸭山市", "鸡西市", "大庆市", "伊春市", "牡丹江市", "佳木斯市", "七台河市", "黑河市", "绥化市", "哈尔滨市", "齐齐哈尔市", "大兴安岭地区"],
	// 内蒙古
	["呼和浩特市", "包头市", "乌海市", "赤峰市", "乌兰察布市", "锡林郭勒盟", "呼伦贝尔市", "鄂尔多斯市", "巴彦淖尔市", "阿拉善盟", "兴安盟", "通辽市"],
	// 江苏
	["南京市", "徐州市", "连云港市", "淮安市", "宿迁市", "盐城市", "扬州市", "泰州市", "南通市", "镇江市", "常州市", "无锡市", "苏州市"],
	// 山东
	["济宁市", "济南市", "青岛市", "淄博市", "枣庄市", "东营市", "潍坊市", "烟台市", "威海市", "莱芜市", "德州市", "临沂市", "聊城市", "滨州市", "菏泽市", "日照市", "泰安市"],
	// 安徽
	["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"],
	// 浙江
	["宁波市", "衢州市", "丽水市", "台州市", "舟山市", "杭州市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市"],
	// 福建
	["福州市", "厦门市", "三明市", "莆田市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"],
	// 湖北
	["武汉市", "黄石市", "十堰市", "宜昌市", "襄阳市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施州", "仙桃市", "潜江市", "天门市", "神农架", "江汉油田"],
	// 湖南
	["耒阳市", "长沙市", "株洲市", "湘潭市", "韶山市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "郴州市", "益阳市", "永州市", "怀化市", "娄底市", "湘西州"],
	// 广东 
	["广州市", "深圳市", "珠海市", "汕头市", "韶关市", "河源市", "梅州市", "揭阳市", "惠州市", "汕尾市", "东莞市", "中山市", "江门市", "佛山市", "阳江市", "湛江市", "茂名市", "肇庆市", "云浮市", "清远市", "潮州市"],
	// 广西
	["崇左市", "南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "贺州市", "百色市", "河池市", "来宾市"],
	// 江西 		
	["南昌市", "景德镇市", "萍乡市", "新余市", "九江市", "鹰潭市", "上饶市", "宜春市", "抚州市", "吉安市", "赣州市"],
	// 四川
	["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝州", "甘孜市", "凉山市"],
	// 海南
	["三亚市", "文昌市", "五指山市", "临高县", "澄迈县", "定安县", "屯昌县", "昌江县", "白沙县", "琼中县", "陵水县", "保亭县", "乐东县", "三沙市", "海口市", "琼海市", "万宁市", "东方市", "儋州市"],
	// 贵州
	["贵阳市", "六盘水市", "遵义市", "铜仁市", "毕节市", "安顺市", "黔西南州", "黔东南州", "黔南州"],
	// 云南
	["迪庆州", "昆明市", "曲靖市", "玉溪市", "昭通市", "普洱市", "临沧市", "保山市", "丽江市", "文山州", "红河州", "西双版纳州", "楚雄州", "大理州", "德宏州", "怒江州"],
	// 西藏
	["阿里地区", "林芝地区", "拉萨市", "那曲地区", "山南地区", "昌都地区", "日喀则地区"],
	// 陕西
	["延安市", "汉中市", "榆林市", "商洛市", "安康市", "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市"],
	// 甘肃
	["庆阳市", "陇南市", "武威市", "张掖市", "酒泉市", "甘南州", "临夏州", "定西市", "兰州市", "金昌市", "白银市", "天水市", "嘉峪关市", "平凉市"],
	// 青海
	["西宁市", "海东地区", "海北州", "黄南州", "海南州", "果洛州", "玉树州", "海西州"],
	// 宁夏
	["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"],
	// 新疆																																									
	["五家渠市", "阿拉尔市", "图木舒克市", "乌鲁木齐市", "克拉玛依市", "石河子市", "吐鲁番地区", "哈密地区", "和田地区", "阿克苏地区", "喀什地区", "克孜勒苏州", "巴音郭楞州", "昌吉州", "博尔塔拉州", "伊犁州", "塔城地区", "阿勒泰地区", "博尔塔拉蒙古自治州阿拉山口口岸"],
	// 台湾
	["台北市", "高雄市", "基隆市", "台中市", "台南市", "新竹市", "嘉义市", "台北县", "宜兰县", "新竹县", "桃园县", "苗栗县", "台中县", "彰化县", "南投县", "嘉义县", "云林县", "台南县", "高雄县", "屏东县", "台东县", "花莲县", "澎湖县"],
	// 香港
	["中西区", "东区", "九龙城区", "观塘区", "南区", "深水区", "湾仔区", "黄大仙区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区", "沙田区", "屯门区", "大埔区", "荃湾区", "元朗区"],
	// 澳门
	["花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区"],
	// 钓鱼岛
	["钓鱼岛"]	
];
//三级分类
var districtAreaArr = [
	/* 北京 */
	[	
		// 朝阳区
		["朝阳区"],
		// 海淀区
		["海淀区"],
		// 西城区
		["西城区"],
		// 东城区
		["东城区"],
		// 崇文区
		["崇文区"],
		// 宣武区
		["宣武区"],
		// 丰台区
		["丰台区"],
		// 石景山区
		["石景山区"],
		// 门头沟区
		["门头沟区"],
		// 房山区
		["房山区"],
		// 通州区
		["通州区"],
		// 大兴区
		["大兴区"],
		// 顺义区
		["顺义区"],
		// 怀柔区
		["怀柔区"],
		// 密云区
		["密云区"],
		// 昌平区
		["昌平区"],
		// 平谷区
		["平谷区"],
		// 延庆县
		["延庆县"]
	],
	/* 上海 */
	[	
		// 徐汇区
		["徐汇区"],
		// 长宁区
		["长宁区"],
		// 静安区
		["静安区"],
		// 闸北区
		["闸北区"],
		// 虹口区
		["虹口区"],
		// 杨浦区
		["杨浦区"],
		// 宝山区
		["宝山区"],
		// 闵行区
		["闵行区"],
		// 嘉定区
		["嘉定区"],
		// 浦东新区
		["浦东新区"],
		// 青浦区
		["青浦区"],
		// 松江区
		["松江区"],
		// 金山区
		["金山区"],
		// 南汇区
		["南汇区"],
		// 奉贤区
		["奉贤区"],
		// 普陀区
		["普陀区"],
		// 崇明县
		["崇明县"],
		// 黄浦区
		["黄浦区"]
	],
	/* 天津 */
	[	
		// 东丽区
		["东丽区"],
		// 和平区
		["和平区"],
		// 河北区
		["河北区"],
		// 河东区
		["河东区"],
		// 河西区
		["河西区"],
		// 红桥区
		["红桥区"],
		// 蓟县
		["蓟县"],
		// 静海县
		["静海县"],
		// 南开区
		["南开区"],
		// 塘沽区
		["塘沽区"],
		// 西青区
		["西青区"],
		// 武清区
		["武清区"],
		// 津南区
		["津南区"],
		// 汉沽区
		["汉沽区"],
		// 大港区
		["大港区"],
		// 北辰区
		["北辰区"],
		// 宝坻区
		["宝坻区"],
		// 宁河县
		["宁河县"]
	],
	/* 重庆 */
	[
		// 万州区
		["万州区"],
		// 涪陵区
		["涪陵区"],
		// 渝中区
		["渝中区"],
		// 大渡口区
		["大渡口区"],
		// 江北区
		["江北区"],
		// 沙坪坝区
		["沙坪坝区"],
		// 九龙坡区
		["九龙坡区"],
		// 南岸区
		["南岸区"],
		// 北碚区
		["北碚区"],
		// 万盛区
		["万盛区"],
		// 双桥区
		["双桥区"],
		// 渝北区
		["渝北区"],
		// 巴南区
		["巴南区"],
		// 黔江区
		["黔江区"],
		// 长寿区
		["长寿区"],
		// 江津区
		["江津区"],
		// 合川区
		["合川区"],
		// 南川区
		["南川区"],
		// 綦江县
		["綦江县"],
		// 潼南县
		["潼南县"],
		// 铜梁县
		["铜梁县"],
		// 大足县
		["大足县"],
		// 荣昌县
		["荣昌县"],
		// 璧山县
		["璧山县"],
		// 梁平县
		["梁平县"],
		// 城口县
		["城口县"],
		// 丰都县
		["丰都县"],
		// 垫江县
		["垫江县"],
		// 武隆县
		["武隆县"],
		// 忠县
		["忠县"],
		// 开县
		["开县"],
		// 云阳县
		["云阳县"],
		// 奉节县
		["奉节县"],
		// 巫山县
		["巫山县"],
		// 巫溪县
		["巫溪县"],
		// 石柱土家族自治县
		["石柱土家族自治县"],
		// 秀山土家族苗族自治县
		["秀山土家族苗族自治县"],
		// 酉阳土家族苗族自治县
		["酉阳土家族苗族自治县"],
		// 彭水苗族土家族自治县
		["彭水苗族土家族自治县"],
		// 永川区
		["永川区"],
		// 北部新区
		["北部新区"]
	],
	/* 河北 */
	[	
		// 石家庄市
		["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市"],
		// 邯郸市
		["邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸县", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县", "武安市"],
		// 邢台市
		["桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市"],
		// 保定市
		["新市区", "北市区", "南市区", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "涿州市", "定州市", "安国市", "高碑店市"],
		// 张家口市
		["桥东区", "桥西区", "宣化区", "下花园区", "宣化县", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "万全县", "怀来县", "涿鹿县", "赤城县", "崇礼县"],
		// 承德市
		["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁县", "宽城县", "围场县"],
		// 秦皇岛市
		["海港区", "山海关区", "北戴河区", "青龙县", "昌黎县", "抚宁县", "卢龙县"],
		// 唐山市
		["路南区", "路北区", "古冶区", "开平区", "丰南区", "丰润区", "滦县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县", "遵化市", "迁安市"],
		// 沧州市
		["新华区", "运河区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村县", "泊头市", "任丘市", "黄骅市", "河间市"],
		// 廊坊市
		["安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂县", "霸州市", "三河市"],
		// 衡水市
		["桃城区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县", "冀州市", "深州市"]
	],
	/* 山西 */
	[	
		// 太原市
		["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"],
		// 大同市
		["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"],
		// 阳泉市
		["城区", "矿区", "郊区", "平定县", "盂县"],
		// 晋城市
		["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"],
		// 朔州市
		["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县"],
		// 晋中市
		["榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁县", "平遥县", "灵石县", "介休市"],
		// 忻州市
		["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市"],
		// 吕梁市
		["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市"],
		// 临汾市
		["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市"],
		// 运城市
		["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"],
		// 长治市
		["城区", "郊区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "潞城市"]
	],
	/* 河南 */
	[	
		// 郑州市
		["中原区", "二七区", "管城", "金水区", "上街区", "惠济区", "高新区", "中牟县", "巩义市", "荥阳市", "新密市", "新郑市", "登封市"],
		// 开封市
		["龙亭区", "顺河回族区", "鼓楼区", "禹王台区", "金明区", "杞县", "通许县", "尉氏县", "开封县", "兰考县"],
		// 洛阳市
		["老城区", "西工区", "瀍河回族区", "涧西区", "吉利区", "洛龙区", "孟津县", "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县", "偃师市"],
		// 平顶山市
		["新华区", "卫东区", "石龙区", "湛河区", "宝丰县", "叶县", "鲁山县", "郏县", "舞钢市", "汝州市"],
		// 焦作市
		["解放区", "中站区", "马村区", "山阳区", "修武县", "博爱县", "武陟县", "温县", "沁阳市", "孟州市"],
		// 鹤壁市
		["鹤山区", "山城区", "淇滨区", "浚县", "淇县"],
		// 新乡市
		["红旗区", "卫滨区", "凤泉区", "牧野区", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "长垣县", "卫辉市", "辉县市"],
		// 安阳市
		["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "汤阴县", "滑县", "内黄县", "林州市"],
		// 濮阳市
		["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县"],
		// 许昌市
		["魏都区", "许昌县", "鄢陵县", "襄城县", "禹州市", "长葛市"],
		// 漯河市
		["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县"],
		// 三门峡市
		["湖滨区", "渑池县", "陕县", "卢氏县", "义马市", "灵宝市"],
		// 南阳市
		["宛城区", "卧龙区", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", "邓州市"],
		// 商丘市
		["梁园区", "睢阳区", "民权县", "睢县", "宁陵县", "柘城县", "虞城县", "夏邑县", "永城市"],
		// 周口市
		["川汇区", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县", "淮阳县", "太康县", "鹿邑县", "项城市"],
		// 驻马店市
		["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县", "遂平县", "新蔡县"],
		// 信阳市
		["浉河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县", "息县"],
		// 济源市
		["济源市"]
	],
	/* 辽宁 */
	[	
		// 沈阳市
		["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "沈北新区", "浑南新区", "于洪区", "辽中县", "康平县", "法库县", "新民市"],
		// 大连市
		["中山区", "西岗区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "长海县", "瓦房店市", "普兰店市", "庄河市"],
		// 鞍山市
		["铁东区", "铁西区", "立山区", "千山区", "台安县", "岫岩县", "海城市"],
		// 抚顺市
		["新抚区", "东洲区", "望花区", "顺城区", "抚顺县", "新宾县", "清原县"],
		// 本溪市
		["平山区", "溪湖区", "明山区", "南芬区", "本溪县", "桓仁县"],
		// 丹东市
		["元宝区", "振兴区", "振安区", "宽甸县", "东港市", "凤城市"],
		// 锦州市
		["古塔区", "凌河区", "太和区", "黑山县", "义县", "凌海市", "北镇市"],
		// 葫芦岛市
		["连山区", "龙港区", "南票区", "绥中县", "建昌县", "兴城市", "杨家杖子开发区"],
		// 营口市
		["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市"],
		// 盘锦市
		["双台子区", "兴隆台区", "大洼县", "盘山县"],
		// 阜新市
		["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新县", "彰武县"],
		// 辽阳市
		["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "辽阳县", "灯塔市"],
		// 朝阳市
		["双塔区", "龙城区", "朝阳县", "建平县", "喀左", "北票市", "凌源市"],
		// 铁岭市
		["银州区", "清河区", "铁岭县", "西丰县", "昌图县", "调兵山市", "开原市"]
	],
	/* 吉林 */
	[	
		// 长春市
		["南关区", "宽城区", "朝阳区", "二道区", "绿园区", "双阳区", "农安县", "九台市", "榆树市", "德惠市"],
		// 吉林市
		["昌邑区", "龙潭区", "船营区", "丰满区", "永吉县", "蛟河市", "桦甸市", "舒兰市", "磐石市"],
		// 四平市
		["铁西区", "铁东区", "梨树县", "伊通满族自治县", "公主岭市", "双辽市"],
		// 辽源市
		["龙山区", "西安区", "东丰县", "东辽县"],
		// 通化市
		["东昌区", "二道江区", "通化县", "辉南县", "柳河县", "梅河口市", "集安市"],
		// 白山市
		["八道江区", "江源区", "抚松县", "靖宇县", "长白县", "临江市"],
		// 松原市
		["宁江区", "前郭尔罗斯", "长岭县", "乾安县", "扶余县"],
		// 白城市
		["洮北区", "镇赉县", "通榆县", "洮南市", "大安市"],
		// 延边州
		["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"]
	],
	/* 黑龙江 */
	[	
		// 鹤岗市
		["向阳区", "工农区", "南山区", "兴安区", "东山区", "兴山区", "萝北县", "绥滨县"],
		// 双鸭山市
		["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "友谊县", "宝清县", "饶河县"],
		// 鸡西市
		["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "鸡东县", "虎林市", "密山市"],
		// 大庆市
		["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特"],
		// 伊春市
		["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区", "上甘岭区", "嘉荫县", "铁力市"],
		// 牡丹江市
		["东安区", "阳明区", "爱民区", "西安区", "东宁县", "林口县", "绥芬河市", "海林市", "宁安市", "穆棱市"],
		// 佳木斯市
		["向阳区", "前进区", "东风区", "郊区", "桦南县", "桦川县", "汤原县", "抚远县", "同江市", "富锦市"],
		// 七台河市
		["新兴区", "桃山区", "茄子河区", "勃利县"],
		// 黑河市
		["爱辉区", "嫩江县", "逊克县", "孙吴县", "北安市", "五大连池市"],
		// 绥化市
		["北林区", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县", "安达市", "肇东市", "海伦市"],
		// 哈尔滨市
		["道里区", "南岗区", "道外区", "平房区", "松北区", "香坊区", "呼兰区", "阿城区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县", "延寿县", "双城市", "尚志市", "五常市"],
		// 齐齐哈尔市
		["龙沙区", "建华区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县", "克东县", "拜泉县", "讷河市"],
		// 大兴安岭地区
		["加格达奇区", "松岭区", "新林区", "呼中区", "呼玛县", "塔河县", "漠河县"]
	],
	/* 内蒙古 */
	[	
		// 呼和浩特市
		["新城区", "回民区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县"],
		// 包头市
		["东河区", "昆都仑区", "青山区", "石拐区", "白云矿区", "九原区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗"],
		// 乌海市
		["海勃湾区", "海南区", "乌达区"],
		// 赤峰市
		["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗"],
		// 乌兰察布市
		["集宁区", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"],
		// 锡林郭勒盟
		["二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县"],
		// 呼伦贝尔市
		["海拉尔区", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里市", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市"],
		// 鄂尔多斯市
		["东胜区", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"],
		// 巴彦淖尔市
		["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"],
		// 阿拉善盟
		["阿拉善左旗", "阿拉善右旗", "额济纳旗"],
		// 兴安盟
		["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"],
		// 通辽市
		["科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒市"],
	],
	/* 江苏 */
	[	
		// 南京市
		["玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "浦口区", "栖霞区", "雨花台区", "江宁区", "六合区", "溧水县", "高淳县"],
		// 徐州市
		["鼓楼区", "云龙区", "九里区", "贾汪区", "泉山区", "丰县", "沛县", "铜山县", "睢宁县", "新沂市", "邳州市"],
		// 连云港市
		["连云区", "新浦区", "海州区", "赣榆县", "东海县", "灌云县", "灌南县"],
		// 淮安市
		["清河区", "楚州区", "淮阴区", "清浦区", "涟水县", "洪泽县", "盱眙县", "金湖县"],
		// 宿迁市
		["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县"],
		// 盐城市
		["亭湖区", "盐都区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县", "东台市", "大丰市"],
		// 扬州市
		["广陵区", "邗江区", "维扬区", "宝应县", "仪征市", "高邮市", "江都市"],
		// 泰州市
		["海陵区", "高港区", "兴化市", "靖江市", "泰兴市", "姜堰市"],
		// 南通市
		["崇川区", "港闸区", "海安县", "如东县", "启东市", "如皋市", "通州市", "海门市"],
		// 镇江市
		["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市"],
		// 常州市
		["天宁区", "钟楼区", "戚墅堰区", "新北区", "武进区", "溧阳市", "金坛市"],
		// 无锡市
		["崇安区", "南长区", "北塘区", "锡山区", "惠山区", "滨湖区", "江阴市", "宜兴市"],
		// 苏州市
		["沧浪区", "平江区", "金阊区", "虎丘区", "吴中区", "相城区", "常熟市", "张家港市", "昆山市", "吴江市", "太仓市"]
	],
	/* 山东 */
	[	
		// 济宁市
		["市中区", "任城区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "兖州市", "邹城市"],
		// 济南市
		["历下区", "市中区", "槐荫区", "天桥区", "高新区", "历城区", "长清区", "平阴县", "济阳县", "商河县", "章丘市"],
		// 青岛市
		["市南区", "市北区", "四方区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市"],
		// 淄博市
		["淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县"],
		// 枣庄市
		["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市"],
		// 东营市
		["东营区", "河口区", "垦利县", "利津县", "广饶县"],
		// 潍坊市
		["潍城区", "寒亭区", "坊子区", "奎文区", "临朐县", "昌乐县", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市"],
		// 烟台市
		["芝罘区", "福山区", "牟平区", "莱山区", "长岛县", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市"],
		// 威海市
		["环翠区", "文登市", "荣成市", "乳山市"],
		// 莱芜市
		["莱城区", "钢城区"],
		// 德州市
		["德城区", "陵县", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市"],
		// 临沂市
		["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "苍山县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县"],
		// 聊城市
		["东昌府区", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", "临清市"],
		// 滨州市
		["滨城区", "惠民县", "阳信县", "无棣县", "沾化县", "博兴县", "邹平县"],
		// 菏泽市
		["牡丹区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "定陶县", "东明县"],
		// 日照市
		["东港区", "岚山区", "五莲县", "莒县"],
		// 泰安市
		["泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市"]
	],
	/* 安徽 */
	[
		// 合肥市
		["瑶海区", "庐阳区", "蜀山区", "新站区", "高新区", "经开区", "包河区", "长丰县", "肥东县", "肥西县"],
		// 芜湖市
		["镜湖区", "弋江区", "鸠江区", "三山区", "芜湖县", "繁昌县", "南陵县"],
		// 蚌埠市
		["龙子湖区", "蚌山区", "禹会区", "淮上区", "怀远县", "五河县", "固镇县"],
		// 淮南市
		["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县"],
		// 马鞍山市
		["金家庄区", "花山区", "雨山区", "开发区", "博望新区", "示范园区", "当涂县", "含山县", "和县"],
		// 淮北市
		["杜集区", "相山区", "烈山区", "濉溪县"],
		// 铜陵市
		["铜官山区", "狮子山区", "郊区", "铜陵县"],
		// 安庆市
		["迎江区", "大观区", "宜秀区", "怀宁县", "枞阳县", "潜山县", "太湖县", "宿松县", "望江县", "岳西县", "桐城市"],
		// 黄山市
		["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县"],
		// 滁州市
		["琅琊区", "南谯区", "来安县", "全椒县", "定远县", "凤阳县", "天长市", "明光市"],
		// 阜阳市
		["颍州区", "颍东区", "颍泉区", "临泉县", "太和县", "阜南县", "颍上县", "界首市"],
		// 宿州市
		["埇桥区", "砀山县", "萧县", "灵璧县", "泗县"],
		// 巢湖市
		["居巢区", "庐江县", "无为县", "和县"],
		// 六安市
		["金安区", "裕安区", "寿县", "霍邱县", "舒城县", "金寨县", "霍山县"],
		// 亳州市
		["谯城区", "涡阳县", "蒙城县", "利辛县"],
		// 池州市
		["贵池区", "东至县", "石台县", "青阳县"],
		// 宣城市
		["宣州区", "郎溪县", "广德县", "泾县", "绩溪县", "旌德县", "宁国市"]
	],
	/* 浙江 */
	[	
		// 宁波市
		["海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "象山县", "宁海县", "余姚市", "慈溪市", "奉化市"],
		// 衢州市
		["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"],
		// 丽水市
		["莲都区", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁", "龙泉市"],
		// 台州市
		["椒江区", "黄岩区", "路桥区", "玉环县", "三门县", "天台县", "仙居县", "温岭市", "临海市"],
		// 舟山市
		["定海区", "普陀区", "岱山县", "嵊泗县"],
		// 杭州市
		["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区", "桐庐县", "淳安县", "建德市", "富阳市", "临安市"],
		// 温州市
		["鹿城区", "龙湾区", "瓯海区", "洞头县", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", "瑞安市", "乐清市"],
		// 嘉兴市
		["南湖区", "秀洲区", "嘉善县", "海盐县", "海宁市", "平湖市", "桐乡市"],
		// 湖州市
		["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"],
		// 绍兴市
		["越城区", "绍兴县", "新昌县", "诸暨市", "上虞市", "嵊州市"],
		// 金华市
		["婺城区", "金东区", "武义县", "浦江县", "磐安县", "兰溪市", "义乌市", "东阳市", "永康市"]
	],
	/* 福建 */
	[	
		// 福州市
		["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "平潭县", "福清市", "长乐市"],
		// 厦门市
		["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"],
		// 三明市
		["梅列区", "三元区", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙县", "将乐县", "泰宁县", "建宁县", "永安市"],
		// 莆田市
		["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"],
		// 泉州市
		["鲤城区", "丰泽区", "洛江区", "泉港区", "惠安县", "安溪县", "永春县", "德化县", "金门县", "石狮市", "晋江市", "南安市"],
		// 漳州市
		["芗城区", "龙文区", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县", "南靖县", "平和县", "华安县", "龙海市"],
		// 南平市
		["延平区", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山市", "建瓯市", "建阳市"],
		// 龙岩市
		["新罗区", "长汀县", "永定县", "上杭县", "武平县", "连城县", "漳平市"],
		// 宁德市
		["蕉城区", "霞浦县", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "福安市", "福鼎市"]
	],
	/* 湖北 */
	[	// 武汉市
		["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区", "东湖开发区", "武汉经济开发区"],
		// 黄石市
		["黄石港区", "西塞山区", "下陆区", "铁山区", "阳新县", "黄石经济开发区", "大冶市"],
		// 十堰市
		["茅箭区", "张湾区", "郧县", "郧西县", "竹山县", "竹溪县", "房县", "十堰经济开发区", "武当山旅游经济特区", "丹江口市"],
		// 宜昌市
		["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "远安县", "兴山县", "秭归县", "长阳县", "五峰县", "宜都市", "当阳市", "枝江市"],
		// 襄阳市
		["襄城区", "樊城区", "襄阳区", "南漳县", "谷城县", "保康县", "老河口市", "枣阳市", "宜城市", "隆中风景区", "高新开发区", "鱼梁洲开发区"],
		// 鄂州市
		["梁子湖区", "华容区", "鄂城区", "葛店开发区", "鄂州经济开发区"],
		// 荆门市
		["东宝区", "掇刀区", "京山县", "沙洋县", "钟祥市", "屈家岭", "荆门经济开发区"],
		// 孝感市
		["孝南区", "孝昌县", "大悟县", "云梦县", "应城市", "安陆市", "汉川市"],
		// 荆州市
		["沙市区", "荆州区", "公安县", "监利县", "江陵县", "石首市", "洪湖市", "松滋市", "荆州经济开发区"],
		// 黄冈市
		["黄州区", "团风县", "红安县", "罗田县", "英山县", "浠水县", "蕲春县", "黄梅县", "麻城市", "武穴市", "龙感湖管理区"],
		// 咸宁市
		["咸安区", "嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市", "湖北省咸宁市咸宁经济开发区"],
		// 随州市
		["曾都区", "随县", "广水市"],
		// 恩施州
		["恩施市", "利川市", "建始县", "巴东县", "宣恩县", "咸丰县", "来凤县", "鹤峰县"],
		// 仙桃市
		["仙桃市"],
		// 潜江市
		["潜江市"],
		// 天门市
		["天门市"],
		// 神农架
		["神农架"],
		// 江汉油田
		["江汉油田"]
	],
	/* 湖南 */
	[	
		// 耒阳市
		["耒阳市", "蔡子池区"],
		// 长沙市
		["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "长沙县", "望城县", "宁乡县", "浏阳市"],
		// 株洲市
		["荷塘区", "芦淞区", "石峰区", "天元区", "株洲县", "攸县", "茶陵县", "炎陵县", "醴陵市"],
		// 湘潭市
		["雨湖区", "岳塘区", "湘潭县", "湘乡市"],
		// 韶山市
		["韶山市"],
		// 衡阳市
		["珠晖区", "雁峰区", "石鼓区", "蒸湘区", "南岳区", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", "常宁市"],
		// 邵阳市
		["双清区", "大祥区", "北塔区", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步", "武冈市"],
		// 岳阳市
		["岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "湘阴县", "平江县", "汨罗市", "临湘市"],
		// 常德市
		["武陵区", "鼎城区", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", "津市市"],
		// 张家界市
		["永定区", "武陵源区", "慈利县", "桑植县"],
		// 郴州市
		["北湖区", "苏仙区", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", "资兴市"],
		// 益阳市
		["资阳区", "赫山区", "南县", "桃江县", "安化县", "沅江市"],
		// 永州市
		["零陵区", "冷水滩区", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华"],
		// 怀化市
		["鹤城区", "中方县", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳", "新晃", "芷江", "靖州", "通道", "洪江市"],
		// 娄底市
		["娄星区", "双峰县", "新化县", "冷水江市", "涟源市"],
		// 湘西州
		["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县"]
	],
	/* 广东 */
	[	
		// 广州市
		["荔湾区", "越秀区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "萝岗区", "增城市", "从化市"],
		// 深圳市
		["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区"],
		// 珠海市
		["香洲区", "斗门区", "金湾区"],
		// 汕头市
		["龙湖区", "金平区", "濠江区", "潮阳区", "潮南区", "澄海区", "南澳县"],
		// 韶关市
		["武江区", "浈江区", "曲江区", "始兴县", "仁化县", "翁源县", "乳源", "新丰县", "乐昌市", "南雄市"],
		// 河源市
		["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县"],
		// 梅州市
		["梅江区", "梅县", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "兴宁市"],
		// 揭阳市
		["榕城区", "揭东县", "揭西县", "惠来县", "普宁市"],
		// 惠州市
		["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县"],
		// 汕尾市
		["城区", "海丰县", "陆河县", "陆丰市"],
		// 东莞市
		["长安镇", "莞城区", "南城区", "寮步镇", "大岭山镇", "横沥镇", "常平镇", "厚街镇", "万江区", "樟木头镇", "塘厦镇", "凤岗镇", "大朗镇", "东坑镇", "清溪镇", "企石镇", "茶山镇", "东城区", "虎门镇", "黄江镇", "石排镇", "道滘镇", "沙田镇", "高埗镇", "石龙镇", "石碣镇", "洪梅镇", "麻涌镇", "松山湖", "桥头镇", "望牛墩镇", "中堂镇", "谢岗镇"],
		// 中山市
		["城区", "火炬开发区", "小榄镇", "古镇", "三乡镇", "民众镇", "东凤镇", "板芙镇", "神湾镇", "横栏镇", "港口镇", "三角镇", "大涌镇", "南头镇", "沙溪镇", "坦洲镇", "黄圃镇", "五桂山镇", "南朗镇", "沙朗镇", "阜沙镇", "东升镇"],
		// 江门市
		["蓬江区", "江海区", "新会区", "台山市", "开平市", "鹤山市", "恩平市"],
		// 佛山市
		["禅城区", "南海区", "顺德区", "三水区", "高明区"],
		// 阳江市
		["江城区", "阳西县", "阳东县", "阳春市"],
		// 湛江市
		["赤坎区", "霞山区", "坡头区", "麻章区", "遂溪县", "徐闻县", "廉江市", "雷州市", "吴川市"],
		// 茂名市
		["茂南区", "茂港区", "电白县", "高州市", "化州市", "信宜市"],
		// 肇庆市
		["端州区", "鼎湖区", "广宁县", "怀集县", "封开县", "德庆县", "高要市", "四会市"],
		// 云浮市
		["云城区", "新兴县", "郁南县", "云安县", "罗定市"],
		// 清远市
		["清城区", "佛冈县", "阳山县", "连山", "连南", "清新县", "英德市", "连州市"],
		// 潮州市
		["枫溪区", "湘桥区", "潮安县", "饶平县"]
	],
	/* 广西 */
	[
		// 崇左市
		["江州区", "凭祥市", "扶绥县", "大新县", "天等县", "宁明县", "龙州县"],
		// 南宁市
		["良庆区", "江南区", "兴宁区", "青秀区", "西乡塘区", "横县", "上林县", "隆安县", "马山县", "武鸣区", "邕宁区", "宾阳县"],
		// 柳州市
		["融安县", "三江县", "融水县", "鱼峰区", "城中区", "柳南区", "柳北区", "柳江县", "柳城县", "鹿寨县"],
		// 桂林市
		["象山区", "恭城县", "秀峰区", "叠彩区", "七星区", "雁山区", "阳朔县", "临桂县", "灵川县", "全州县", "平乐县", "兴安县", "灌阳县", "荔浦县", "资源县", "永福县", "龙胜县"],
		// 梧州市
		["岑溪市", "苍梧县", "藤县", "蒙山县", "万秀区", "蝶山区", "长洲区"],
		// 北海市
		["海城区", "银海区", "合浦县", "铁山港区"],
		// 防城港市
		["防城区", "港口区", "东兴市", "上思县"],
		// 钦州市
		["钦南区", "钦北区", "浦北县", "灵山县"],
		// 贵港市
		["港南区", "港北区", "桂平市", "平南县", "覃塘区"],
		// 玉林市
		["玉州区", "北流市", "容县", "博白县", "陆川县", "兴业县"],
		// 贺州市
		["八步区", "钟山县", "昭平县", "富川县", "平桂管理区"],
		// 百色市
		["右江区", "平果县", "乐业县", "田阳县", "西林县", "田林县", "德保县", "靖西县", "田东县", "那坡县", "隆林县", "凌云县"],
		// 河池市
		["宜州市", "天峨县", "凤山县", "南丹县", "东兰县", "巴马县", "环江县", "大化县", "都安县", "金城江区", "罗城县"],
		// 来宾市
		["兴宾区", "合山市", "忻城县", "武宣县", "象州县", "金秀县"]
	],
	/* 江西 */
	[	
		// 南昌市
		["青云谱区", "西湖区", "东湖区", "昌北区", "南昌县", "进贤县", "安义县", "青山湖区", "红谷滩新区", "新建县", "湾里区", "高新区"],
		// 景德镇市	
		["珠山区", "乐平市", "浮梁县", "昌江区"],
		// 萍乡市
		["湘东区", "莲花县", "上栗县", "芦溪县", "安源区"],
		// 新余市
		["分宜县", "渝水区"],
		// 九江市
		["九江县", "瑞昌市", "星子县", "武宁县", "彭泽县", "永修县", "修水县", "湖口县", "德安县", "都昌县", "共青城市", "八里湖新区", "庐山区", "浔阳区", "经济技术开发区", "庐山风景名胜区"],
		// 鹰潭市
		["余江县", "贵溪市", "月湖区", "龙虎山风景旅游区"],
		// 上饶市
		["德兴市", "广丰县", "鄱阳县", "婺源县", "余干县", "横峰县", "弋阳县", "铅山县玉", "山县", "万年县", "信州区", "上饶县"],
		// 宜春市
		["丰城市", "樟树市", "袁州区", "高安市", "铜鼓县", "靖安县", "宜丰县", "奉新县", "万载县", "上高县"],
		// 抚州市
		["南丰县", "乐安县", "金溪县", "南城县", "东乡县", "资溪县", "宜黄县", "崇仁县", "黎川县", "广昌县", "临川区"],
		// 吉安市
		["青原区", "吉州区", "井冈山市", "吉安县", "永丰县", "永新县", "新干县", "泰和县", "峡江县", "遂川县", "安福县", "吉水县", "万安县"],
		// 赣州市
		["章贡区", "南康市", "瑞金市", "石城县", "安远县", "赣县", "宁都县", "寻乌县", "兴国县", "定南县", "上犹县", "于都县", "龙南县", "崇义县", "大余县", "信丰县", "全南县", "会昌县"]
	],
	/* 四川 */	
	[
		// 成都市
		["武侯区", "金牛区", "青羊区", "成华区", "高新区", "锦江区", "郫县", "双流县", "高新西区", "龙泉驿区", "新都区", "温江区", "都江堰市", "彭州市", "青白江区", "崇州市", "金堂县", "新津县", "邛崃市", "大邑县", "蒲江县"],
		// 自贡市	
		["自流井区", "沿滩区", "荣县", "富顺县", "大安区", "贡井区"],
		// 攀枝花市			
		["仁和区", "西区", "东区", "米易县", "盐边县"],
		// 泸州市
		["纳溪区", "江阳区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县"],
		// 德阳市
		["广汉市", "什邡市", "旌阳区", "绵竹市", "罗江县", "中江县"],
		// 绵阳市
		["江油市", "涪城区", "游仙区", "高新区", "经开区", "盐亭县", "三台县", "平武县", "北川县", "安县", "梓潼县"],
		// 广元市
		["元坝区", "朝天区", "利州区", "青川县", "旺苍县", "剑阁县", "苍溪县"],
		// 遂宁市
		["船山区", "射洪县", "蓬溪县", "大英县", "安居区"],
		// 内江市
		["东兴区", "资中县", "隆昌县", "威远县", "市中区"],
		// 乐山市
		["市中区", "峨眉山市", "五通桥区", "沙湾区", "金口河区", "夹江县", "井研县", "犍为县", "沐川县", "峨边县", "马边县"],
		// 南充市
		["顺庆区", "高坪区", "嘉陵区", "西充县", "阆中市", "南部县", "仪陇县", "蓬安县", "营山县"],
		// 眉山市
		["仁寿县", "彭山县", "洪雅县", "丹棱县", "青神县", "东坡区"],
		// 宜宾市
		["宜宾县", "南溪区", "江安县", "长宁县", "兴文县", "珙县", "翠屏区", "高县", "屏山县", "筠连县"],
		// 广安市
		["前锋区", "岳池县", "武胜县", "邻水县", "广安区", "华蓥市"],
		// 达州市
		["通川区", "达县", "大竹县", "渠县", "万源市", "宣汉县", "开江县"],
		// 雅安市
		["芦山县", "石棉县", "名山区", "天全县", "荥经县", "汉源县", "宝兴县", "雨城区"],
		// 巴中市
		["巴州区", "恩阳区", "南江县", "平昌县", "通江县"],
		// 资阳市
		["雁江区", "安岳县", "乐至县", "简阳市"],
		// 阿坝州
		["马尔康县", "九寨沟县", "红原县", "阿坝县", "理县", "若尔盖县", "金川县", "小金县", "黑水县", "松潘县", "壤塘县", "茂县", "汶川县"],
		// 甘孜市
		["康定县", "泸定县", "九龙县", "丹巴县", "道孚县", "炉霍县", "色达县", "甘孜县", "新龙县", "白玉县", "德格县", "石渠县", "雅江县", "理塘县", "巴塘县", "稻城县", "乡城县", "得荣县"],
		// 凉山市
		["美姑县", "昭觉县", "会理县", "会东县", "普格县", "宁南县", "德昌县", "冕宁县", "盐源县", "金阳县", "布拖县", "雷波县", "越西县", "喜德县", "甘洛县", "木里县", "西昌市"]
	],
	/* 海南 */
	[
		// 三亚市
		["三亚市"],
		// 文昌市
		["文昌市"],
		// 五指山市
		["五指山市"],
		// 临高县
		["临高县"],
		// 澄迈县
		["澄迈县"],
		// 定安县
		["定安县"],
		// 屯昌县
		["屯昌县"],
		// 昌江县
		["昌江县"],
		// 白沙县
		["白沙县"],
		// 琼中县
		["琼中县"],
		// 陵水县
		["陵水县"],
		// 保亭县
		["保亭县"],
		// 乐东县
		["乐东县"],
		// 三沙市
		["三沙市"],
		// 海口市
		["秀英区", "龙华区", "琼山区", "美兰区"],
		// 琼海市
		["琼海市"],
		// 万宁市
		["万宁市"],
		// 东方市
		["东方市"],
		// 儋州市
		["儋州市"]
	],
	/* 贵州 */
	[
		// 贵阳市
		["南明区", "云岩区", "花溪区", "小河区", "白云区", "清镇市", "开阳县", "修文县", "息烽县", "乌当区", "观山湖区"],
		// 六盘水市				
		["盘县", "六枝特区", "水城县", "钟山区"],
		// 遵义市
		["红花岗区", "汇川区", "赤水市", "仁怀市", "遵义县", "桐梓县", "绥阳县", "习水县", "凤冈县", "正安县", "湄潭县", "余庆县", "道真县", "务川县"],
		// 铜仁市														
		["碧江区", "德江县", "江口县", "思南县", "万山区", "石阡县", "玉屏侗族自治县", "松桃苗族自治县", "印江土家族", "苗族自治县", "沿河土家族自治县"],
		// 毕节市
		["七星关区", "黔西县", "大方县", "织金县", "金沙县", "赫章县", "纳雍县", "威宁彝族回族苗族自治县"],
		// 安顺市
		["西秀区", "普定县", "平坝县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县", "紫云苗族布依族自治县"],
		// 黔西南州
		["兴义市", "望谟县", "兴仁县", "普安县", "册亨县", "晴隆县", "贞丰县", "安龙县"],
		// 黔东南州
		["凯里市", "施秉市", "从江县", "锦屏县", "镇远县", "麻江县", "台江县", "天柱县", "黄平县", "榕江县", "剑河县", "三穗县", "雷山县", "黎平县", "岑巩县", "丹寨县"],
		// 黔南州
		["都匀市", "福泉市", "贵定县", "惠水县", "罗甸县", "瓮安县", "荔波县", "龙里县", "平塘县", "长顺县", "独山县", "三都县"]
	],
	/* 云南 */
	[
		// 迪庆州
		["香格里拉县", "德钦县", "维西县"],
		// 昆明市
		["盘龙区", "五华区", "西山区", "官渡区", "呈贡区", "东川区", "安宁市", "富民县", "嵩明县", "晋宁县", "宜良县", "禄劝县", "石林县", "寻甸县"],
		// 曲靖市			
		["麒麟区", "马龙县", "宣威市", "富源县", "会泽县", "陆良县", "师宗县", "罗平县", "沾益县"],
		// 玉溪市
		["红塔区", "华宁县", "澄江县", "易门县", "通海县", "江川县", "元江县", "新平县", "峨山县"],
		// 昭通市
		["鲁甸县", "绥江县", "昭阳区", "镇雄县", "永善县", "大关县", "盐津县", "彝良县", "水富县", "巧家县", "威信县"],
		// 普洱市
		["孟连县", "思茅区", "宁洱县", "景东县", "镇沅县", "景谷县", "墨江县", "澜沧县", "西盟县", "江城县"],
		// 临沧市
		["双江县", "沧源县", "临翔区", "镇康县", "凤庆县", "云县", "永德县", "耿马县"],
		// 保山市
		["隆阳区", "施甸县", "昌宁县", "龙陵县", "腾冲县"],
		// 丽江市
		["玉龙县", "华坪县", "永胜县", "宁蒗县", "古城区"],
		// 文山州
		["文山市", "麻栗坡县", "砚山县", "广南县", "马关县", "富宁县", "西畴县", "丘北县"],
		// 红河州		
		["个旧市", "开远市", "弥勒县", "红河县", "绿春县", "蒙自市", "泸西县", "建水县", "元阳县", "石屏县", "金平县", "屏边县", "河口县"],
		// 西双版纳州
		["景洪市", "勐海县", "勐腊县"],
		// 楚雄州
		["元谋县", "南华县", "牟定县", "武定县", "大姚县", "双柏县", "禄丰县", "永仁县", "姚安县", "楚雄市"],
		// 大理州
		["剑川县", "弥渡县", "云龙县", "洱源县", "鹤庆县", "宾川县", "祥云县", "永平县", "巍山县", "漾濞县", "南涧县", "大理市"],
		// 德宏州
		["芒市", "瑞丽市", "盈江县", "梁河县", "陇川县"],
		// 怒江州
		["泸水县", "福贡县", "兰坪县", "贡山县"]
	],
	/* 西藏 */
	[
		// 阿里地区
		["噶尔县", "普兰县", "札达县", "日土县", "革吉县", "改则县", "措勤县"],
		// 林芝地区
		["林芝县", "工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县"],
		// 拉萨市
		["城关区", "林周县", "当雄县", "尼木县", "曲水县", "堆龙德庆县", "达孜县", "墨竹工卡县"],
		// 那曲地区
		["索县", "那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "班戈县", "巴青县", "尼玛县"],
		// 山南地区
		["乃东县", "扎囊县", "贡嘎县", "桑日县", "琼结县", "曲松县", "措美县", "洛扎县", "加查县", "隆子县", "错那县", "浪卡子县"],
		// 昌都地区
		["昌都县", "江达县", "贡觉县", "类乌齐县", "丁青县", "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县", "边坝县"],
		// 日喀则地区
		["日喀则市", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县"]
	],
	/* 陕西 */
	[
		// 延安市
		["宝塔区", "安塞县", "洛川县", "子长县", "黄陵县", "延长县", "宜川县", "延川县", "甘泉县", "富县", "志丹县", "黄龙县", "吴起县"],
		// 汉中市	
		["汉台区", "南郑县", "城固县", "洋县", "佛坪县", "留坝县", "镇巴县", "西乡县", "勉县", "略阳县", "宁强县"],
		// 榆林市
		["清涧县", "绥德县", "佳县", "神木县", "府谷县", "子洲县", "横山县", "米脂县", "吴堡县", "定边县", "榆阳区", "靖边县"],
		// 商洛市
		["商州区", "镇安县", "山阳县", "洛南县", "商南县", "丹凤县", "柞水县"],
		// 安康市
		["汉滨区", "紫阳县", "岚皋县", "旬阳县", "镇坪县", "平利县", "宁陕县", "汉阴县", "石泉县", "白河县"],
		// 西安市		
		["新城区", "雁塔区", "未央区", "长安区", "灞桥区", "碑林区", "莲湖区", "临潼区", "阎良区", "高陵县", "蓝田县", "户县", "周至县"],
		// 铜川市			
		["印台区", "宜君县", "王益区", "耀州区"],
		// 宝鸡市
		["渭滨区", "金台区", "岐山县", "太白县", "凤翔县", "陇县", "麟游县", "千阳县", "扶风县", "凤县", "眉县", "陈仓区"],
		// 咸阳市
		["秦都区", "渭城区", "兴平市", "礼泉县", "泾阳县", "永寿县", "三原县", "彬县", "旬邑县", "长武县", "乾县", "武功县", "淳化县", "杨陵区"],
		// 渭南市
		["韩城市", "华阴市", "蒲城县", "华县", "潼关县", "大荔县", "澄城县", "合阳县", "白水县", "富平县", "临渭区"]
	],
	/* 甘肃 */
	[
		// 庆阳市
		["庆城县", "西峰区", "镇原县", "合水县", "华池县", "环县", "宁县", "正宁县"],
		// 陇南市
		["成县", "礼县", "康县", "武都区", "文县", "两当县", "徽县", "宕昌县", "西和县"],
		// 武威市
		["凉州区", "古浪县", "天祝县", "民勤县"],
		// 张掖市
		["甘州区", "山丹县", "临泽县", "高台县", "肃南县", "民乐县"],
		// 酒泉市			
		["金塔县", "阿克塞县", "肃北县", "瓜州县", "肃州区", "玉门市", "敦煌市"],
		// 甘南州
		["合作市", "夏河县", "碌曲县", "舟曲县", "玛曲县", "迭部县", "临潭县", "卓尼县"],
		// 临夏州		
		["临夏县", "康乐县", "永靖县", "和政县", "积石山县", "临夏市", "广河县", "东乡族自治县"],
		// 定西市
		["岷县", "安定区", "通渭县", "临洮县", "漳县", "渭源县", "陇西县"],
		// 兰州市
		["七里河区", "安宁区", "城关区", "西固区", "红古区", "永登县", "榆中县", "皋兰县"],
		// 金昌市	
		["永昌县", "金川区"],
		// 白银市
		["白银区", "平川区", "靖远县", "景泰县", "会宁县"],
		// 天水市		
		["麦积区", "秦州区", "甘谷县", "武山县", "清水县", "秦安县", "张家川县"],
		// 嘉峪关市
		["长城区", "镜铁区", "雄关区"],
		// 平凉市
		["静宁县", "崆峒区", "华亭县", "崇信县", "泾川县", "灵台县", "庄浪县"]
	],
	/* 青海 */
	[
		// 西宁市
		["湟中县", "湟源县", "大通县", "城中区", "城东区", "城西区", "城北区"],
		// 海东地区
		["平安县", "乐都县", "民和县", "互助县", "化隆县", "循化县"],
		// 海北州
		["海晏县", "祁连县", "刚察县", "门源县"],
		// 黄南州
		["尖扎县", "同仁县", "泽库县", "河南县"],
		// 海南州
		["共和县", "同德县", "贵德县", "兴海县", "贵南县"],
		// 果洛州
		["玛沁县", "甘德县", "达日县", "班玛县", "久治县", "玛多县"],
		// 玉树州
		["玉树县", "称多县", "囊谦县", "杂多县", "治多县", "曲麻莱县"],
		// 海西州
		["德令哈市", "乌兰县", "天峻县", "都兰县", "大柴旦行委", "冷湖行委", "茫崖行委", "格尔木市"]
	],
	/* 宁夏 */
	[
		// 银川市
		["灵武市", "永宁县", "贺兰县", "兴庆区", "金凤区", "西夏区"],
		// 石嘴山市
		["平罗县", "惠农区", "大武口区"],
		// 吴忠市	
		["青铜峡市", "同心县", "盐池县", "利通区", "红寺堡开发区"],
		// 固原市
		["西吉县", "隆德县", "泾源县", "彭阳县", "原州区"],
		// 中卫市	
		["中宁县", "海原县", "沙坡头区"]
	],
	/* 新疆 */
	[
		// 五家渠市
		["五家渠市"],
		// 阿拉尔市
		["阿拉尔市"],
		// 图木舒克市
		["图木舒克市"],
		// 乌鲁木齐市
		["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "米东区", "乌鲁木齐县"],
		// 克拉玛依市
		["克拉玛依区", "独山子区", "乌尔禾区", "白碱滩区"],
		// 石河子市
		["石河子市"],
		// 吐鲁番地区
		["吐鲁番市", "托克逊县", "鄯善县"],
		// 哈密地区		
		["哈密市", "巴里坤县", "伊吾县"],
		// 和田地区			
		["和田县", "和田市", "墨玉县", "洛浦县", "策勒县", "于田县", "民丰县", "皮山县"],
		// 阿克苏地区
		["阿克苏市", "温宿县", "沙雅县", "拜城县", "阿瓦提县", "库车县", "柯坪县", "新和县", "乌什县"],
		// 喀什地区
		["喀什市", "巴楚县", "泽普县", "伽师县", "叶城县", "岳普湖县", "疏附县", "疏勒县", "英吉沙县", "麦盖提县", "莎车县", "塔什库尔干县"],
		// 克孜勒苏州		
		["阿图什市", "阿合奇县", "乌恰县", "阿克陶县"],
		// 巴音郭楞州
		["库尔勒市", "尉犁县", "和静县", "博湖县", "和硕县", "轮台县", "若羌县", "且末县", "焉耆县"],
		// 昌吉州
		["昌吉市", "阜康市", "奇台县", "玛纳斯县", "吉木萨尔县", "呼图壁县", "木垒县"],
		// 博尔塔拉州
		["阿拉山口市", "博乐市", "精河县", "温泉县"],
		// 伊犁州
		["伊宁县", "伊宁市", "特克斯县", "尼勒克县", "昭苏县", "新源县", "霍城县", "察布查尔县", "巩留县", "奎屯市"],
		// 塔城地区			
		["塔城市", "乌苏市", "额敏县", "裕民县", "沙湾县", "托里县", "和布克赛尔县"],
		// 阿勒泰地区		
		["北屯市", "阿勒泰市", "富蕴县", "青河县", "吉木乃县", "布尔津县", "福海县", "哈巴河县"],
		// 博尔塔拉蒙古自治州阿拉山口口岸
		["博尔塔拉蒙古自治州阿拉山口口岸"]
	],
	/* 台湾 */
	[
		// 台北市
		["台北市"],
		// 高雄市
		["高雄市"],
		// 基隆市
		["基隆市"],
		// 台中市
		["台中市"],
		// 台南市
		["台南市"],
		// 新竹市
		["新竹市"],
		// 嘉义市
		["嘉义市"],
		// 台北县
		["台北县"],
		// 宜兰县
		["宜兰县"],
		// 新竹县
		["新竹县"],
		// 桃园县
		["桃园县"],
		// 苗栗县
		["苗栗县"],
		// 台中县
		["台中县"],
		// 彰化县
		["彰化县"],
		// 南投县
		["南投县"],
		// 嘉义县
		["嘉义县"],
		// 云林县
		["云林县"],
		// 台南县
		["台南县"],
		// 高雄县
		["高雄县"],
		// 屏东县
		["屏东县"],
		// 台东县
		["台东县"],
		// 花莲县
		["花莲县"],
		// 澎湖县
		["澎湖县"]
	],
	/* 香港 */
	[
		// 中西区
		["中西区"],
		// 东区
		["东区"],
		// 九龙城区
		["九龙城区"],
		// 观塘区
		["观塘区"],
		// 南区
		["南区"],
		// 深水区
		["深水区"],
		// 湾仔区
		["湾仔区"],
		// 黄大仙区
		["黄大仙区"],
		// 油尖旺区
		["油尖旺区"],
		// 离岛区
		["离岛区"],
		// 葵青区
		["葵青区"],
		// 北区
		["北区"],
		// 西贡区
		["西贡区"],
		// 沙田区
		["沙田区"],
		// 屯门区
		["屯门区"],
		// 大埔区
		["大埔区"],
		// 荃湾区
		["荃湾区"],
		// 元朗区
		["元朗区"]
	],
	/* 澳门 */
	[
		// 花地玛堂区
		["花地玛堂区"],
		// 圣安多尼堂区
		["圣安多尼堂区"],
		// 大堂区
		["大堂区"],
		// 望德堂区
		["望德堂区"],
		// 风顺堂区
		["风顺堂区"],
		// 嘉模堂区
		["嘉模堂区"],
		// 圣方济各堂区
		["圣方济各堂区"]
	],
	/* 钓鱼岛 */
	[
		["钓鱼岛"]
	]
	
];